[Reference](https://towardsdatascience.com/reordering-pandas-dataframe-columns-thumbs-down-on-standard-solutions-1ff0bc2941d5)

In [1]:
import pandas as pd

# Write some example data
df = pd.DataFrame({'names':['Al','Myke','Lovie','Dash'], 
                   'Grade': [6,7,6,6],
                   'Teacher':['Ogna','Hayes','Stoltz','Edens'],
                   'Score':['A+','A-','B','C'],
                   'Room':['Green','Red','Blue','Yellow'],
                   'Hobby':['Coins','Stamps','Coins','Cards']})

In [2]:
# Reset DataFrame with columns in desired order
df = df[['names','Score','Room','Grade','Teacher','Hobby']]

In [3]:
# Evaluate the DataFrame with columns in desired order
df[['names','Score','Room','Grade','Teacher','Hobby']]

   names Score    Room  Grade Teacher   Hobby
0     Al    A+   Green      6    Ogna   Coins
1   Myke    A-     Red      7   Hayes  Stamps
2  Lovie     B    Blue      6  Stoltz   Coins
3   Dash     C  Yellow      6   Edens   Cards

In [4]:
mid = df['Hobby']
df.drop(labels=['Hobby'], axis=1, inplace = True)
df.insert(1, 'Hobby', mid)
df

   names   Hobby Score    Room  Grade Teacher
0     Al   Coins    A+   Green      6    Ogna
1   Myke  Stamps    A-     Red      7   Hayes
2  Lovie   Coins     B    Blue      6  Stoltz
3   Dash   Cards     C  Yellow      6   Edens

In [5]:
def movecol(df, cols_to_move=[], ref_col='', place='After'):
    
    cols = df.columns.tolist()    
    
    if place == 'After':
        seg1 = cols[:list(cols).index(ref_col) + 1]
        seg2 = cols_to_move
    if place == 'Before':
        seg1 = cols[:list(cols).index(ref_col)]
        seg2 = cols_to_move + [ref_col]
    
    seg1 = [i for i in seg1 if i not in seg2]
    seg3 = [i for i in cols if i not in seg1 + seg2]
    
    return(df[seg1 + seg2 + seg3])

In [6]:
df = movecol(df, 
             cols_to_move=['Score','Grade'], 
             ref_col='Room',
             place='After')
df

   names   Hobby    Room Score  Grade Teacher
0     Al   Coins   Green    A+      6    Ogna
1   Myke  Stamps     Red    A-      7   Hayes
2  Lovie   Coins    Blue     B      6  Stoltz
3   Dash   Cards  Yellow     C      6   Edens